# Выполнил: Кошеваров Дмитрий
# Группа ИУ7-16Б
# Назначение программы: Бабочка

# ВВОД ДАННЫХ
x = abs(float(input('введите x: ')))
y = float(input('введите y: '))


# Рассмотрение двух случаев y >= 0 и y < 0
# будем рассматривать большие промежутки в которые попадает x


# Вычсления
m = False
if y >= 0:
    p1 = ((y <= -4*x**2+2) or (y == 1.5*x + 2)) and (0 <= x <= 1)
    p2 = ((y >= (1/49)*(x-1)**2) and (y <= (-1/8) * (x-9)**2 + 8)) and (1<= x <=8)
    p3 = ((y >= 7*(x-8) + 1) and (y <= (-1/8) * (x-9)**2 + 8)) and (8 <= x <= 9)
    m = p1 or p2 or p3
else:
    p1 = ((y <= -4*x**2+2) and (y >= 4*x**2 - 6)) and (0 <= x <= 1)
    p2 = (-2 <= y <= 0) and x == 1
    p3 = ((y <= (-1/16)*x**2) and (y >= -2*(x-1)**2 - 2)) and (1 <= x <= 2)
    p4 = ((y <= (-1/16)*x**2) and (y >= 1/3 * (x - 5)**2 - 7)) and (2 <= x <= 8)
    m = p1 or p2 or p3 or p4
    
if m:
    print('Точка принадлежит')
else:
    print('Точка не принадлежит')